Revit 2027 API
ExportIFCCategoryKey Properties
The ExportIFCCategoryKey type exposes the following members.
Properties
Name | Description
CategoryName |  The Revit category name.
CustomSubCategoryId |  The Revit custom subcategory id.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SubCategoryName |  The Revit subcategrory name.
Top
See Also
Reference
ExportIFCCategoryKey Class
Autodesk.Revit.DB Namespace